rails/w5d3/rails-99-cats/app/controllers/cats_controller.rb

    def show
      @cats = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", "   sefsfgsgesg "], ["updated_at", "2019-06-19 22:08:34.032537"], ["id", 8]]