rails/w5d1/first-routes/app/controllers/artworks_controller.rb

    def index
      user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def show
      render json: Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]