rails/w5d1/first-routes/app/controllers/artwork_shares_controller.rb

    def create
      artwork_share = ArtworkShare.new(artwork_shares_params)
      if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 7], ["created_at", "2019-06-18 20:01:40.504147"], ["updated_at", "2019-06-18 20:01:40.504147"]]