rails/w5d1/first-routes/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def index

    case
    when params[:user_id]
      user = User.find(params[:user_id])
      users_comments = user.comments
      render json: users_comments
    when params[:artwork_id]
      artwork = Artwork.find(params[:artwork_id])