rails/w5d1/first-routes/app/controllers/users_controller.rb

    def index

        user = User.where('username ILIKE ?', "%#{params[:username]}%")
        if !user.empty?
          render json: user
        else
          render json: User.all
---
SELECT "users".* FROM "users" WHERE (username IS LIKE '%Billy%')
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Macc"], ["LIMIT", 1]]
SELECT "users".* FROM "users"