rails/w5d5/music-app/app/views/tracks/_form.html.erb


    <% Album.all.each do |album|%>
---
SELECT "albums".* FROM "albums"