rails/w5d5/music-app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---

    <% Band.all.each do |band|%>