rails/w6d1/goal-app/app/controllers/application_controller.rb

  def current_user
    @current_user = User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]