rails/w5d5/music-app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "2pkdoFSKwYM/M0Z78kk4Hw=="], ["updated_at", "2019-06-21 17:18:20.340973"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.base64(16)
    self.save