rails/w6d4/reddit-project/app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "RTOiVY-_7yffMzL5opQjLA"], ["LIMIT", 1]]

  def admin?
    Sub.all.each do |sub|
---
SELECT  "subs".* FROM "subs" ORDER BY "subs"."id" ASC LIMIT $1  [["LIMIT", 1]]