rails/w6d4/reddit-project/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 1], ["post_id", 4], ["created_at", "2019-06-27 23:26:55.410308"], ["updated_at", "2019-06-27 23:26:55.410308"]]
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "seoaig"], ["url", "soeigjaeg"], ["content", "aoeisjfois"], ["user_id", 1], ["created_at", "2019-06-27 23:19:33.966520"], ["updated_at", "2019-06-27 23:19:33.966520"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_ids = params[:sub_ids]
    if @post.save