rails/w6d4/reddit-project/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "cameron"], ["password_digest", "$2a$12$o9bVvPMk5ESBHkzZO6ZTx.Fb1q46mdAUYDCLkOV0sEc78//dL9.la"], ["session_token", "XzKSHy1dQlJfJo_3Bw90oQ"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1 WHERE "users"."id" = $2  [["password_digest", "$2a$12$Amrxv1l.yWR2nRVpUVNBFO719mt8QlSLX5sN5Iepv4k/dX/VVPHRa"], ["id", 1]]