rails/w5d5/music-app/app/controllers/albums_controller.rb

  def new
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("name", "band_id", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sergeys album"], ["band_id", 2], ["year", 1994], ["live", true], ["created_at", "2019-06-21 21:40:38.323669"], ["updated_at", "2019-06-21 21:40:38.323669"]]