rails/w5d5/music-app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "2pkdoFSKwYM/M0Z78kk4Hw=="], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]

    @current_user ||= User.find_by_session_token(session[:session_token])