rails/w5d5/music-app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Rage against the Machine"], ["updated_at", "2019-06-21 21:41:50.662313"], ["id", 2]]
---
  def update
    @band = Band.find(params[:id])

    if @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    @band = Band.find(params[:id])
    @band.destroy