rails/w5d5/music-app/app/controllers/notes_controller.rb

  def create
    note = current_user.notes.new(note_params)
    note.save
---
INSERT INTO "notes" ("track_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["track_id", 1], ["user_id", 2], ["content", "my new content"], ["created_at", "2019-06-21 23:27:41.158424"], ["updated_at", "2019-06-21 23:27:41.158424"]]

  def destroy
    note = current_user.notes.find(params[:id])
    note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]