rails/w5d5/music-app/app/controllers/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @track = Track.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("album_id", "name", "ord", "bonus", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 2], ["name", "new track"], ["ord", 4], ["bonus", true], ["lyrics", "wetowjegjepgjsg"], ["created_at", "2019-06-21 22:51:49.599915"], ["updated_at", "2019-06-21 22:51:49.599915"]]
---
  def create
    @track = Track.new(track_params)

    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "bonus" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["bonus", true], ["lyrics", "We're gonna rage all day and rock all night"], ["updated_at", "2019-06-21 22:28:47.291345"], ["id", 1]]
---
  def update
    @track = Track.find(params[:id])

    if @track.update(track_params)