rails/w6d4/reddit-project/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "RTOiVY-_7yffMzL5opQjLA"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!